import "./privacy-policy.scss";
export default function PrivacyPolicy() {
  return (
    <section className='privat-policy'>
      <h2>Политика конфиденциальности</h2>

      <ol className='list'>
        {  /* #1 */}
        <li className='list__item'>
          <span>Термины, используемые в Соглашении</span>
          <div className="desciption">
            <p><strong>Сайт, Ресурс</strong> — интернет-ресурс salebot.pro</p>
            <p><strong>Администрация</strong> — сотрудники Компании, а также лица, уполномоченные надлежащим образом Компанией на управление Ресурсом и предоставление Услуг Посетителям, в рамках использования Сайта последними.</p>
            <p><strong>Сервисы</strong> — совокупность программ для ЭВМ, баз данных, обеспечивающих функционирование Сайта, а также совокупность Услуг, предоставляемых Пользователям при использовании Сайта.</p>
            <p><strong>Посетитель</strong> — любое физическое лицо, старше 16 лет, использующее Ресурс.</p>
            <p><strong>Пользователь</strong> — Посетитель, прошедший процедуру регистрации.</p>
            <p><strong>Логин</strong> — псевдоним Пользователя, выбранный им при регистрации и используемый им в процессе пользования Сайтом. Запрещается регистрировать и использовать несколько Логинов одним и тем же Посетителем.</p>
            <p><strong>Пароль</strong> — символьная комбинация, выбираемая Пользователем самостоятельно и обеспечивающая в совокупности с Логином его идентификацию при использовании Ресурса.</p>
            <p><strong>Бот/Чат-бот</strong> — это компьютерная программа, которая создана для имитации речевого поведения человека при общении с одним или несколькими собеседниками.</p>
            <p><strong>Учетное время</strong> — время проекта. Все даты, указываемые при использовании Сайта и Сервисов, учитываются по московскому времени.</p>
          </div>

        </li>
        {/* #2 */}
        <li className='list__item'>
          <span>Общие положения</span>
          <div className="desciption">
            <p>Настоящее Соглашение регулирует порядок использования Сайта, а также взаимоотношения, возникающие при использовании Сайта и Сервисов Посетителями. Компания не гарантирует доступность Сайта и Сервисов круглосуточно. Компания имеет право в любой момент отказать любому Посетителю, в том числе Пользователю, в использовании Сайта и Сервисов при нарушении Соглашения: https://salebot.pro/terms . Компания предоставляет Посетителям, Пользователям личное неисключительное и непередаваемое право использовать Сайт и программное обеспечение, представленное на сайте, в соответствии с настоящим Соглашением, при условии, что ни Посетитель/Пользователь, ни любые иные лица при содействии Посетителя/Пользователя не будут совершать действий:</p>
            <p>по копированию или изменению программного обеспечение Сайта, Сервисов; по созданию программ, производных от программного обеспечения Сайта и Сервисов;</p>
            <p>по проникновению в программное обеспечение с целью получения кодов программ;</p>
            <p>по осуществлению продажи, уступки, сдачи в аренду, передачи третьим лицам в любой иной форме прав в отношении материала Сайта и программного обеспечения Сайта;</p>
            <p>по модифицированию Сайта и Сервисов, в том числе с целью получения несанкционированного доступа к нему;</p>
            <p>и иных действий, аналогичных перечисленным выше и нарушающих права Компании и третьих лиц.</p>

            <p>
              Посетитель\/Пользователь несет ответственность за соблюдение прав (материальных и нематериальных) третьих лиц на информацию, переданную (предоставленную) Администрации или третьим лицам при использовании Сайта и Сервисов. Пользователи самостоятельно оценивают правомерность использования ими Сайта и Сервисов, в том числе и с точки зрения законодательства страны, резидентами которой они являются.
            </p>
          </div>
        </li>
        {/* #3 */}
        <li className='list__item'>
          <span>
            Регистрация Пользователя
          </span>
          <div className="desciption">
            <p>Лицо, желающее стать Пользователем, обязано пройти процедуру регистрации на соответствующей странице Ресурса. При регистрации Заказчику/Исполнителю присваивается выбранная им пара Логин плюс Пароль, которая используется в дальнейшем Заказчиком/Исполнителем при работе с Сайтом. Не допускается использование псевдонима:</p>

            <p>а) уже используемого иным Пользователем;</p>
            <p>б) оскорбляющего Посетителей, Компанию, Администрацию, третьих лиц.</p>


            <p>
              Пользователь самостоятельно выбирает себе Пароль, однако Компания настоятельно рекомендует использовать пароли, длиной не менее 6 (шести) символов и включающие одновременно строчные и заглавные буквы, а также цифры. Пользователь самостоятельно несет ответственность за сохранность Пароля в тайне от третьих лиц. Компания не несет ни какой ответственности в случае нарушения прав Пользователя третьими лицами, получившими несанкционированный доступ к паре Логин плюс Пароль.
            </p>
          </div>
        </li>
        {/* #4 */}
        <li className='list__item'>
          <span>
            Качество предоставления услуг и границы ответственности
          </span>
          <div className="desciption">
            <p>В случае претензий Пользователя к качеству Услуг Сайта не производит никаких компенсаций в сторону Пользователя, а также не несёт ответственности за какие-либо убытки Пользователя, возникшие вследствие использования или невозможности использования Сервиса. SaleBot оставляет за собой исключительное право квалифицировать особенность работы Сервиса как недостаток (ошибку, дефект и т.п.), а также произвести одно из следующих действий:</p>
            <p>Компания не гарантирует, что:</p>
            <ul className='list-content'>
              <li>Сервис соответствует/будет соответствовать требованиям Пользователя;</li>
              <li>Сервис будет работать непрерывно, быстро, надежно и без ошибок;</li>
              <li>Результаты, которые могут быть получены с использованием сервиса, будут точными и надежными и могут использоваться для каких-либо целей или в каком-либо качестве (например, для установления и/или подтверждения каких-либо фактов);</li>
              <li>Качество какого-либо продукта, услуги, информации и пр., полученных с использованием Сервиса, будет соответствовать ожиданиям Пользователя.</li>
            </ul>

            <p >Кроме того, Компания:</p>

            <ul className='list-content'>
              <li>Скорректирует особенность работы Сервиса в следующей версии;</li>
              <li>Скорректирует особенность работы Сервиса в разумные сроки после ее обнаружения;</li>
              <li>Признает особенность работы Сервиса как неподлежащую изменениям.</li>
            </ul>
          </div>
        </li>
        {/* #5 */}
        <li className='list__item'>
          <span>
            Ответственность Пользователей и Посетителей
          </span>
          <div className="desciption">
            <p>
              Посетители самостоятельно несут ответственность за свои действия/бездействие при использовании Ресурса и Сервисов. Посетители гарантируют, что использование Ресурсов и Сервисов, будет осуществляться ими таким образом, который не будет нарушать права третьих лиц. Посетители гарантируют, что обладают правами на использование материалов, размещаемых ими на сайте. Посетители обязуются соблюдать настоящее Соглашение. При нарушении Посетителями Соглашения Администрация оставляет за собой право временно ограничить доступ Посетителя к Сайту и Сервисам (временный бан), а в случае грубого и/или неоднократного нарушения Соглашения отказать в доступе к Сервисам и Сайту (постоянный бан).
            </p>
          </div>

        </li>
        {/* #6 */}
        <li className='list__item'>
          <span>
            Правила создания Ботов.
          </span>
          <div className="desciption">
            <p>Пользователи могут создавать Ботов. Запрещается создание Ботов:</p>
            <p>а) нарушающих законодательство РФ;</p>
            <p>б) нарушающих нормы морали.</p>
          </div>
        </li>
        {/* #7 */}
        <li className='list__item'>
          <span>
            Сбор данных
          </span>
          <div className="desciption">
            <p>
              Ресурс собирает данные переписки для групп ВКонтакте, подключенных к системе. Ресурс ведет лог работы Бота. Собранные данные используются для обучения Бота и не передаются третьим лицам.
            </p>
          </div>
        </li>
        {/* #8 */}
        <li className='list__item'>
          <span>
            Особые условия
          </span>
          <div className="desciption">
            <p>Компания не гарантирует, что программное обеспечение Сервисов, Сайта не содержит ошибок или будет функционировать бесперебойно.</p>

            <p>Компания не несет никакой ответственности за решения, принятые Администрацией при разрешении конфликтных ситуаций между Пользователями, в том числе по вынесенным вердиктам.</p>

            <p>Компания не несет ответственности за убытки или иной вред, возникший у Пользователя в связи с действиями третьих лиц.</p>

            <p>Компания оставляет за собой право удалять со своих серверов любую информацию или материалы, которые, по мнению Компании, являются неприемлемыми, нежелательными или нарушающими настоящее Соглашение.</p>

            <p>Компания не контролирует информацию, услуги и продукты, находящиеся в или предлагаемые посредством сети Интернет. Вследствие этого Пользователь принимает условие, в соответствии с которым все товары, информация и услуги, предлагаемые или доступные через Сервис или в сети Интернет (за исключением явно указанных как предоставляемые непосредственно Компанией), предоставляются третьими сторонами, которые никак не связаны с Компанией. Пользователь принимает на себя полную ответственность и риски за использование Сервисов и сети Интернет. Компания не предоставляет никаких гарантий на любые товары, информацию и услуги, поставляемые посредством Сервисов или через сеть Интернет вообще. Компания не будет нести ответственности за любые затраты или ущерб, прямо или косвенно возникшие в результате подобных поставок. Пользователь принимает условие, согласно которому он принимает на себя ответственность за оценку точности, полноты и пригодности всех мнений, оценок, услуг и другой информации, качества и функций товаров, предоставляемых посредством Сервисов или сети Интернет вообще.</p>
          </div>
        </li>
        {/* #9 */}
        <li className='list__item'>
          <span>
            Вступление в силу и порядок изменения настоящего Соглашения
          </span>
          <div className="desciption">
            <p>Соглашение, Приложения к Соглашению и изменения к ним вступают силу с момента их опубликования на страницах сайта https://salebot.pro/terms. Изменения в Соглашении и Приложениях к Соглашению могут быть внесены в любое время. Пользователь и/или Посетитель обязуется знакомиться с актуальной версией Соглашения перед каждым использованием Ресурса, Сервисов и/или Услуг Компании. Если Пользователь и/или Посетитель примет решение не соглашаться с измененным Соглашением, то он обязан отказаться от использования Сервиса. Пользователь, продолжающий пользование Ресурсом, Сервисами и/или Услугами Компании, соглашается с изменениями</p>
          </div>
        </li>
      </ol>
    </section >
  )
}
